public class Main {
    public static void main(String[] args) {

        int amount = 8000;
        int mile = 20;
        int bonus = amount / mile;
        System.out.println("Бонусные мили: " + bonus);
    }
}


// Объявляете переменные для входных данных и
// параметров программы: одну для хранения
// стоимости билета, другую для хранения количества
// рублей для одной бонусной мили

// Рассчитываете количество бонусных миль, используя
// значения заведённых переменных. Ответ сохраняете в
// новую переменную и выводите на экран
